//иерархией классов ввода - вывода;
//манипуляторами и управлением вводом - выводом с их помощью;
//способами перегрузки операторов << и >> ;
//чтением и записью текстовых и двоичных файлов;
//функциями ввода - вывода.

//Задание на выполнение лабораторной работы.
//Выполнить лабораторную работу №1(ЗАДАНИЕ 4) с использованием текстовых файлов для ввода данных и вывода результатов.
//Выполнить лабораторную работу №3, дополнив ее методом ввода данных из текстового файла.
//На основе варианта задания лабораторной работы №3 разработать программу, включающую:
//Ввод данных из текстового файла,
//Запись данных в двоичный файл,
//Модификацию данных двоичного файла,
//Удаление данных из двоичного файла,
//Любую арифметическую обработку данных двоичного файла,
//Один из перегруженных операторов << или >> ,
//Собственную манипуляторную функцию.
//Результат выводить в текстовый файл, используя форматный вывод и манипуляторы.

//№2
//Дан двумерный массив V(6, 5).
//Требуется
//ввести исходный массив из текстового файла;
//вывести исходный массив в текстовый файл;
//сформировать массив из минимальных и максимальных элементов четных строк массива;
//напечатать сформированный массив;
//найти и напечатать произведение отрицательных элементов нечетных столбцов исходного массива.
#include "Ex1.h"

using namespace std;



int main() {

	return 1;
}